nxp-mcuxpresso/mcux-sdk/devices/MCXA145/mcuxpresso/startup_mcxa145.cpp
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM33
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // NMI Handler
    HardFault_Handler,                 // Hard Fault Handler
    MemManage_Handler,                 // MPU Fault Handler
    BusFault_Handler,                  // Bus Fault Handler
    UsageFault_Handler,                // Usage Fault Handler
    SecureFault_Handler,               // Secure Fault Handler
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall Handler
    DebugMon_Handler,                  // Debug Monitor Handler
    0,                                 // Reserved
    PendSV_Handler,                    // PendSV Handler
    SysTick_Handler,                   // SysTick Handler

    // Chip Level - MCXA145
    Reserved16_IRQHandler,             // 16: Reserved interrupt
    CMC_IRQHandler,                    // 17: Core Mode Controller interrupt
    DMA_CH0_IRQHandler,                // 18: DMA3_0_CH0 error or transfer complete
    DMA_CH1_IRQHandler,                // 19: DMA3_0_CH1 error or transfer complete
    DMA_CH2_IRQHandler,                // 20: DMA3_0_CH2 error or transfer complete
    DMA_CH3_IRQHandler,                // 21: DMA3_0_CH3 error or transfer complete
    DMA_CH4_IRQHandler,                // 22: DMA3_0_CH4 error or transfer complete
    DMA_CH5_IRQHandler,                // 23: DMA3_0_CH5 error or transfer complete
    DMA_CH6_IRQHandler,                // 24: DMA3_0_CH6 error or transfer complete
    DMA_CH7_IRQHandler,                // 25: DMA3_0_CH7 error or transfer complete
    ERM0_SINGLE_BIT_IRQHandler,        // 26: ERM Single Bit error interrupt
    ERM0_MULTI_BIT_IRQHandler,         // 27: ERM Multi Bit error interrupt
    FMU0_IRQHandler,                   // 28: Flash Management Unit interrupt
    GLIKEY0_IRQHandler,                // 29: GLIKEY Interrupt
    MBC0_IRQHandler,                   // 30: MBC secure violation interrupt
    SCG0_IRQHandler,                   // 31: System Clock Generator interrupt
    SPC0_IRQHandler,                   // 32: System Power Controller interrupt
    VBAT0_IRQHandler,                  // 33: VBAT interrupt
    WUU0_IRQHandler,                   // 34: Wake Up Unit interrupt
    CAN0_IRQHandler,                   // 35: Controller Area Network 0 interrupt
    Reserved36_IRQHandler,             // 36: Reserved interrupt
    Reserved37_IRQHandler,             // 37: Reserved interrupt
    Reserved38_IRQHandler,             // 38: Reserved interrupt
    FLEXIO_IRQHandler,                 // 39: Flexible Input/Output interrupt
    I3C0_IRQHandler,                   // 40: Improved Inter Integrated Circuit interrupt 0
    Reserved41_IRQHandler,             // 41: Reserved interrupt
    LPI2C0_IRQHandler,                 // 42: Low-Power Inter Integrated Circuit interrupt
    LPI2C1_IRQHandler,                 // 43: Low-Power Inter Integrated Circuit interrupt
    LPSPI0_IRQHandler,                 // 44: Low-Power Serial Peripheral Interface interrupt
    LPSPI1_IRQHandler,                 // 45: Low-Power Serial Peripheral Interface interrupt
    Reserved46_IRQHandler,             // 46: Reserved interrupt
    LPUART0_IRQHandler,                // 47: Low-Power Universal Asynchronous Receive/Transmit interrupt
    LPUART1_IRQHandler,                // 48: Low-Power Universal Asynchronous Receive/Transmit interrupt
    LPUART2_IRQHandler,                // 49: Low-Power Universal Asynchronous Receive/Transmit interrupt
    LPUART3_IRQHandler,                // 50: Low-Power Universal Asynchronous Receive/Transmit interrupt
    LPUART4_IRQHandler,                // 51: Low-Power Universal Asynchronous Receive/Transmit interrupt
    USB0_IRQHandler,                   // 52: Universal Serial Bus - Full Speed interrupt
    Reserved53_IRQHandler,             // 53: Reserved interrupt
    CDOG0_IRQHandler,                  // 54: Code Watchdog Timer 0 interrupt
    CTIMER0_IRQHandler,                // 55: Standard counter/timer 0 interrupt
    CTIMER1_IRQHandler,                // 56: Standard counter/timer 1 interrupt
    CTIMER2_IRQHandler,                // 57: Standard counter/timer 2 interrupt
    CTIMER3_IRQHandler,                // 58: Standard counter/timer 3 interrupt
    CTIMER4_IRQHandler,                // 59: Standard counter/timer 4 interrupt
    FLEXPWM0_RELOAD_ERROR_IRQHandler,  // 60: FlexPWM0_reload_error interrupt
    FLEXPWM0_FAULT_IRQHandler,         // 61: FlexPWM0_fault interrupt
    FLEXPWM0_SUBMODULE0_IRQHandler,    // 62: FlexPWM0 Submodule 0 capture/compare/reload interrupt
    FLEXPWM0_SUBMODULE1_IRQHandler,    // 63: FlexPWM0 Submodule 1 capture/compare/reload interrupt
    FLEXPWM0_SUBMODULE2_IRQHandler,    // 64: FlexPWM0 Submodule 2 capture/compare/reload interrupt
    Reserved65_IRQHandler,             // 65: Reserved interrupt
    QDC0_COMPARE_IRQHandler,           // 66: Compare
    QDC0_HOME_IRQHandler,              // 67: Home
    QDC0_WATCHDOG_IRQHandler,          // 68: Watchdog / Simultaneous A and B Change
    QDC0_INDEX_IRQHandler,             // 69: Index / Roll Over / Roll Under
    FREQME0_IRQHandler,                // 70: Frequency Measurement interrupt
    LPTMR0_IRQHandler,                 // 71: Low Power Timer 0 interrupt
    Reserved72_IRQHandler,             // 72: Reserved interrupt
    OS_EVENT_IRQHandler,               // 73: OS event timer interrupt
    WAKETIMER0_IRQHandler,             // 74: Wake Timer Interrupt
    UTICK0_IRQHandler,                 // 75: Micro-Tick Timer interrupt
    WWDT0_IRQHandler,                  // 76: Windowed Watchdog Timer 0 interrupt
    Reserved77_IRQHandler,             // 77: Reserved interrupt
    ADC0_IRQHandler,                   // 78: Analog-to-Digital Converter interrupt
    ADC1_IRQHandler,                   // 79: Analog-to-Digital Converter interrupt
    CMP0_IRQHandler,                   // 80: Comparator interrupt
    CMP1_IRQHandler,                   // 81: Comparator interrupt
    Reserved82_IRQHandler,             // 82: Reserved interrupt
    Reserved83_IRQHandler,             // 83: Reserved interrupt
    Reserved84_IRQHandler,             // 84: Reserved interrupt
    Reserved85_IRQHandler,             // 85: Reserved interrupt
    Reserved86_IRQHandler,             // 86: Reserved interrupt
    GPIO0_IRQHandler,                  // 87: General Purpose Input/Output interrupt 0
    GPIO1_IRQHandler,                  // 88: General Purpose Input/Output interrupt 1
    GPIO2_IRQHandler,                  // 89: General Purpose Input/Output interrupt 2
    GPIO3_IRQHandler,                  // 90: General Purpose Input/Output interrupt 3
    GPIO4_IRQHandler,                  // 91: General Purpose Input/Output interrupt 4
    Reserved92_IRQHandler,             // 92: Reserved interrupt
    LPI2C2_IRQHandler,                 // 93: Low-Power Inter Integrated Circuit interrupt
    LPI2C3_IRQHandler,                 // 94: Low-Power Inter Integrated Circuit interrupt
}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((naked, section(".after_vectors.reset")))
void ResetISR(void) {
    // Disable interrupts
    __asm volatile ("cpsid i");
    // Config VTOR & MSPLIM register
    __asm volatile ("LDR R0, =0xE000ED08  \n"
                    "STR %0, [R0]         \n"
                    "LDR R1, [%0]         \n"
                    "MSR MSP, R1          \n"
                    "MSR MSPLIM, %1       \n"
                    :
                    : "r"(g_pfnVectors), "r"(_vStackBase)
                    : "r0", "r1");

#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();

#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

